import { Aside } from '../../components/aside/aside';
import { screens, useMediaQuery } from '../../hooks/use-media-query';

import styles from './info.module.scss';

export const InfoPage = ({ title }) => {
  const isTablet = useMediaQuery(screens.tablet);

  return (
    <div className='container'>
      <div className={styles.root}>
        {!isTablet && <Aside />}
        <div className={styles.wrap}>
          <h3>{title}</h3>
          <ul className={styles.mainList}>
            <li>
              <p className={styles.mainPunkt}>
                1. Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет
                собой интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
              </p>
              <ul>
                <li>
                  1.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет
                  каждого участника как способного принимать собственные решения касаемо инновационных методов
                  управления процессами.
                </li>
                <li>
                  1.2. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление
                  играет важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности
                  внутренней политики лишь добавляют фракционных разногласий и преданы социально-демократической
                  анафеме.
                </li>
                <li>
                  1.3. Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся
                  непростую экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
                </li>
                <li>
                  1.4. Но независимые государства, которые представляют собой яркий пример континентально-европейского
                  типа политической культуры, будут объединены в целые кластеры себе подобных.
                </li>
              </ul>
            </li>

            <li>
              <p className={styles.mainPunkt}>
                2. С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие
                возможности для приоритизации разума над эмоциями.
              </p>
              <ul>
                <li>
                  <p className={styles.subPunkt}>
                    2.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет
                    каждого участника как способного принимать собственные решения касаемо инновационных методов
                    управления процессами
                  </p>
                  <ul>
                    <li>
                      2.1.1. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное
                      мышление играет важную роль в формировании приоритизации разума над эмоциями. Но некоторые
                      особенности внутренней политики лишь добавляют фракционных разногласий и преданы
                      социально-демократической анафеме.
                    </li>
                    <li>
                      2.1.2. Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся
                      непростую экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
                    </li>
                  </ul>
                  <li>
                    2.2. Но независимые государства, которые представляют собой яркий пример континентально-европейского
                    типа политической культуры, будут объединены в целые кластеры себе подобных.{' '}
                  </li>
                </li>
              </ul>
            </li>
            <li>
              <p className={styles.mainPunkt}>
                3. Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас
                анализа приоритизации разума над эмоциями.
              </p>
              <ul>
                <li>
                  3.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет
                  каждого участника как способного принимать собственные решения касаемо инновационных методов
                  управления процессами.
                </li>
                <ul>
                  <li>
                    3.1.1. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление
                    играет важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности
                    внутренней политики лишь добавляют фракционных разногласий и преданы социально-демократической
                    анафеме.{' '}
                  </li>
                  <li>
                    3.1.2. Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся
                    непростую экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.{' '}
                  </li>
                </ul>
                <li>
                  3.2. Но независимые государства, которые представляют собой яркий пример континентально-европейского
                  типа политической культуры, будут объединены в целые кластеры себе подобных.
                </li>
                <li>
                  3.3. Не следует, однако, забывать, что экономическая повестка сегодняшнего дня требует анализа анализа
                  существующих паттернов поведения.
                  <ul>
                    <li>
                      3.3.1. А ещё представители современных социальных резервов набирают популярность среди
                      определенных слоев населения, а значит, должны быть функционально разнесены на независимые
                      элементы.{' '}
                    </li>
                    <ul>
                      <li>
                        3.3.1.1. Стремящиеся вытеснить традиционное производство, нанотехнологии могут быть объявлены
                        нарушающими общечеловеческие нормы этики и морали.{' '}
                      </li>
                      <li>
                        3.3.1.2. Прежде всего, разбавленное изрядной долей эмпатии, рациональное мышление однозначно
                        фиксирует необходимость новых предложений. Являясь всего лишь частью общей картины, независимые
                        государства представлены в исключительно положительном свете.
                      </li>
                    </ul>
                    <li>
                      3.4. Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас
                      анализа распределения внутренних резервов и ресурсов.
                    </li>
                  </ul>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
    </div>
  );
};
